<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:berov@skylake.(none)" />
</head>

<body>



<ul id="index">
  <li><a href="#">&#x418;&#x41C;&#x466;</a></li>
  <li><a href="#1">&#x411;&#x462;&#x41B;&#x462;&#x416;&#x41A;&#x410;</a></li>
  <li><a href="#2">&#x41E;&#x41F;&#x418;&#x421;&#x410;&#x41D;&#x464;</a></li>
  <li><a href="#3">&#x412;&#x41D;&#x462;&#x414;&#x420;&#x462;&#x412;&#x410;&#x41D;&#x415;</a></li>
  <li><a href="#4">&#xA64A;&#x41A;&#x410;&#x417;&#x410;&#x41D;&#xA656;</a>
    <ul>
      <li><a href="#XCompose">&#x41A;&#x430;&#x43A;&#x44A; &#x440;&#x430;&#x431;&#x47F;&#x438; .XCompose?</a></li>
      <li><a href="#pod">&#x41A;&#x430;&#x43A; &#x434;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x46B; &#x441;&#x442;&#x430;&#x440;&#x438;&#x442;&#x463; &#x431;&#xA64B;&#x43A;&#x432;&#x438;?</a></li>
    </ul>
  </li>
  <li><a href="#5">&#x41F;&#x420;&#x418;&#x41D;&#x41E;&#x421;</a></li>
  <li><a href="#6">&#x421;&#x42A;&#x421;&#x422;&#x410;&#x412;&#x418;&#x41B; &#x422;&#x41E;&#x412;&#x410; &#x420;&#x46A;&#x41A;&#x41E;&#x412;&#x41E;&#x414;&#x421;&#x422;&#x412;&#x41E;</a></li>
  <li><a href="#XCompose1">&#x421;&#x42A;&#x421;&#x422;&#x410;&#x412;&#x418;&#x41B; .XCompose</a></li>
</ul>

<style>
@font-face {
    font-family: 'Veleka';
    src: url('fonts/veleka-regular-webfont.woff2') format('woff2');
    font-weight: normal;
    font-style: normal;
}

@font-face {
    font-family: 'Veleka';
    src: url('fonts/veleka-bolditalic-webfont.woff2') format('woff2');
    font-weight: bold;
    font-style: italic;
}

@font-face {
    font-family: 'Veleka';
    src: url('fonts/veleka-italic-webfont.woff2') format('woff2');
    font-weight: normal;
    font-style: italic;
}

@font-face {
    font-family: 'Veleka';
    src: url('fonts/veleka-bold-webfont.woff2') format('woff2');
    font-weight: bold;
    font-style: normal;
}

@font-face {
    font-family: 'FreeSerif';
    src: url('fonts/freeserif-webfont.woff2') format('woff2');
    font-weight: normal;
    font-style: normal;
}

@font-face {
    font-family: 'FreeSans';
    src: url('fonts/freesans-webfont.woff2') format('woff2');
    font-weight: normal;
    font-style: normal;
}

@font-face {
    font-family: 'FreeMono';
    src: url('fonts/freemono-webfont.woff2') format('woff2');
    font-weight: normal;
    font-style: normal;
}

@font-face {
    font-family: 'BukyvedeRegular';
    src: url('fonts/bukyvede-regular-webfont.woff2') format('woff2');
    font-weight: normal;
    font-style: normal;
}

@font-face {
    font-family: 'BukyvedeRegular';
    src: url('fonts/bukyvede-bold-webfont.woff2') format('woff2');
    font-weight: bolder;
    font-style: normal;
}

/* Generic font styles */
h1,h2,h3,h4,p {
    font-family: Veleka, BukyvedeRegular, FreeSerif, serif;
    font-weight: normal;
}
</style>

<h1 id="">&#x418;&#x41C;&#x466;</h1>

<p>SlovoXCompose</p>

<h1 id="1">&#x411;&#x462;&#x41B;&#x462;&#x416;&#x41A;&#x410;</h1>

<p>&#x41F;&#x440;&#x430;&#x432;&#x43E;&#x43F;&#x438;&#x441;&#x46B;&#x442; &#x438; &#x441;&#x43B;&#x43E;&#x432;&#x43D;&#x438;&#x43A;&#x46B;&#x442;, &#x438;&#x437;&#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x438; &#x432; &#x442;&#x43E;&#x432;&#x430; &#x440;&#x46B;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E; &#x441;&#x46B; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x437;&#x430; &#x443;&#x43F;&#x43E;&#x442;&#x440;&#x463;&#x431;&#x430; &#x43D;&#x430; &#x441;&#x442;&#x430;&#x440;&#x438;&#x442;&#x463; &#x431;&#x443;&#x43A;&#x432;&#x438; &#x438; &#x43D;&#x435; &#x441;&#x467; &#x442;&#x432;&#x44A;&#x440;&#x434;&#x438;, &#x447;&#x435; &#x441;&#x467; &#x441;&#x43F;&#x430;&#x437;&#x432;&#x430;&#x442; &#x43A;&#x430;&#x43A;&#x432;&#x438;&#x442;&#x43E; &#x438; &#x434;&#x430; &#x435; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;, &#x43C;&#x430;&#x43A;&#x430;&#x440; &#x434;&#x430; &#x43E;&#x442;&#x440;&#x430;&#x437;&#x463;&#x432;&#x430;&#x442; &#x434;&#x43E; &#x43D;&#x463;&#x43A;&#x430;&#x43A;&#x432;&#x430; &#x441;&#x442;&#x46B;&#x43F;&#x435;&#x43D; (&#x441;&#x430;&#x43C;&#x43E;)&#x43C;&#x43D;&#x463;&#x43D;&#x438;&#x435;&#x442;&#x43E; &#x43D;&#x430; &#x43F;&#x438;&#x448;&#x435;&#x449;&#x46D;.</p>

<h1 id="2">&#x41E;&#x41F;&#x418;&#x421;&#x410;&#x41D;&#x464;</h1>

<p>&#x422;&#x43E;&#x432;&#x430; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x435; &#x441;&#x44A;&#x434;&#x44A;&#x440;&#x436;&#x430; &#x444;&#x430;&#x439;&#x43B; <code>.XCompose</code> &#x441; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438; &#x437;&#x430; <i>&#x441;&#x44A;&#x441;&#x442;&#x430;&#x432;&#x43D;&#x43E; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x43D;&#x463;</i> &#x43D;&#x430; &#x441;&#x442;&#x430;&#x440;&#x438; &#x431;&#x44A;&#x43B;&#x433;&#x430;&#x440;&#x441;&#x43A;&#x438; &#x431;&#xA64B;&#x43A;&#x432;&#x438; &#x43D;&#x430; &#x42E;&#x43D;&#x438;&#x46F;-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x438; &#xA64B;&#x440;&#x463;&#x434;&#x431;&#x438; &#x441; &#x46E;-&#x441;&#x44A;&#x440;&#x432;&#x44A;&#x440;. &#x422;&#x430;&#x43A;&#x438;&#x432;&#x430; &#x438;&#x437;&#x447;&#x438;&#x441;&#x43B;&#x438;&#x442;&#x435;&#x43B;&#x43D;&#x438; &#xA64B;&#x440;&#x435;&#x434;&#x431;&#x438; &#x441;&#x46B; &#x432;&#x441;&#x438;&#x447;&#x43A;&#x438; &#x438;&#x437;&#x434;&#x430;&#x43D;&#x438;&#xA657; &#x43D;&#x430; &#x41B;&#x438;&#x43D;&#x443;&#x46F;, &#x424;&#x440;&#x438;&#x439;-&#x411;&#x421;&#x414;, &#x41D;&#x415;&#x422;-&#x411;&#x421;&#x414;&hellip; &#x422;&#x43E;&#x432;&#x430; &#x435; &#x432;&#x44A;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x439;-&#x43B;&#x435;&#x441;&#x43D;o &#x43E;&#x441;&#x46B;&#x449;&#x435;&#x441;&#x442;&#x432;&#x438;&#x43C;&#x46D;&#x442; &#x43D;&#x430;&#x447;&#x438;&#x43D; &#x434;&#x430; &#x437;&#x430;&#x43F;&#x43E;&#x447;&#x43D;&#x435;&#x442;&#x463; &#x434;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x442;&#x463; &#x431;&#xA64B;&#x43A;&#x432;&#x438; &#x47F; &#x441;&#x442;&#x430;&#x440;&#x430;&#x442;&#x430; &#x43D;&#x438; &#x430;&#x437;&#x431;&#xA64B;&#x43A;&#x430;. &#x420;&#x430;&#x437;&#x431;&#x438;&#x440;&#x430; &#x441;&#x467;, &#x431;&#x438; &#x431;&#x438;&#x43B;&#x43E; &#x434;&#x43E;&#x431;&#x440;&#x463; &#x434;&#x430; &#x438;&#x43C;&#x430; &#x438; &#x43F;&#x43E;-&#x434;&#x43E;&#x431;&#x44A;&#x440;, &#x43F;&#x43E;-&#x431;&#x44A;&#x440;&#x437; &#x43D;&#x430;&#x447;&#x438;&#x43D;. &#x418;&#x43C;&#x430;, &#x43D;&#x43E; &#x442;&#x43E;&#x439; &#x432;&#x441;&#x435; &#x43E;&#x449;&#x435; &#x43D;&#x435; &#x441;&#x46B;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x432;&#x430; (&#x432; &#x43F;&#x440;&#x463;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x435;&#x43D; &#x432;&#x438;&#x434;). &#x410;&#x43A;&#x43E; &#x438;&#x43C;&#x430;&#x445;&#x43C;&#x435; &#x443;&#x442;&#x432;&#x44A;&#x440;&#x434;&#x435;&#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x435;&#x434;&#x431;&#x430;, &#x442;&#x43E; &#x442;&#x43E;&#x432;&#x430; &#x431;&#x438; &#x431;&#x438;&#x43B;&#x43E; &#x442;&#x43E;&#x437;&#x438; &#x43F;&#x43E;-&#x434;&#x43E;&#x431;&#x44A;&#x440; &#x43D;&#x430;&#x447;&#x438;&#x43D;. &#x423;&#x432;&#x435;&#x440;&#xA657;&#x432;&#x46B; &#x432;&#x438;, &#x447;&#x435; &#x432;&#x435;&#x447;&#x435; &#x435;&#x434;&#x43D;&#x430; &#x441;&#x43A;&#xA64B;&#x43F;&#x438;&#x43D;&#x430; &#x441;&#x44A;&#x43C;&#x438;&#x448;&#x43B;&#x435;&#x43D;&#x438;&#x446;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x438; &#x43F;&#x43E; &#x432;&#x44A;&#x43F;&#x440;&#x43E;&#x441;&#x430;, &#x43C;&#x430;&#x43A;&#x430;&#x440; &#x434;&#x430; &#x435; &#x441;&#x430;&#x43C;&#x43E; &#x443;&#x43C;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43E; &#x437;&#x430;&#x441;&#x463;&#x433;&#x430;.</p>

<p>&#x41F;&#x440;&#x463;&#x434;&#x438;&#x43C;&#x441;&#x442;&#x432;&#x43E;&#x442;&#x43E; &#x43D;&#x430; &#x442;&#x443;&#x43A; &#x43F;&#x440;&#x463;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x46D; &#x43D;&#x430;&#x447;&#x438;&#x43D; &#x435; &#x432; &#x442;&#x43E;&#x432;&#x430;, &#x447;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x463; &#x43B;&#x463;&#x441;&#x43D;&#x43E; &#x434;&#x430; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x463; &#x43D;&#x43E;&#x432;&#x438; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x463;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x47F; &#x437;&#x43D;&#x430;&#x446;&#x438;, &#x43A;&#x43E;&#x438;&#x442;&#x43E; &#x43F;&#x440;&#x438; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x43D;&#x463; &#x434;&#x430; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x463;&#x432;&#x430;&#x442;&#x44A; &#x43D;&#x430; &#x435;&#x43A;&#x440;&#x430;&#x43D;&#x46B; &#x438; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x442;&#x463; &#x432;&#x438; &#x43E;&#x43F;&#x440;&#x463;&#x434;&#x463;&#x43B;&#x435;&#x43D;&#x438; &#x431;&#x443;&#x43A;&#x432;&#x438;, &#x43A;&#x430;&#x43A;&#x442;&#x43E; &#x438; &#x447;&#x435; &#x43B;&#x435;&#x441;&#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x430; &#x441;&#x435; &#x434;&#x43E;&#x441;&#x435;&#x442;&#x438;&#x442;&#x435; &#x43A;&#x430;&#x43A;&#x432;&#x430; &#x431;&#x438; &#x431;&#x438;&#x43B;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x463;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x442;&#x430; &#x43E;&#x442; &#x437;&#x43D;&#x430;&#x446;&#x438;, &#x43A;&#x43E;&#x44F;&#x442;&#x43E; &#x442;&#x440;&#x463;&#x431;&#x432;&#x430; &#x434;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x434;&#x435;&#x442;&#x463;, &#x437;&#x430; &#x434;&#x430; &#x441;&#x435; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x438; &#x43E;&#x43F;&#x440;&#x463;&#x434;&#x463;&#x43B;&#x435;&#x43D; &#x437;&#x43D;&#x430;&#x43A;. &#x422;&#x43E;&#x437;&#x438; &#x43D;&#x430;&#x447;&#x438;&#x43D; &#x435; &#x434;&#x43E;&#x431;&#x44A;&#x440; &#x43F;&#x440;&#x438; &#x441;&#x43F;&#x43E;&#x440;&#x430;&#x434;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x43D;&#x463; &#x43D;&#x430; &#x441;&#x442;&#x430;&#x440;&#x438; &#x431;&#xA64B;&#x43A;&#x432;&#x438;. &#x410;&#x43A;&#x43E; &#x441;&#x467; &#x447;&#x443;&#x434;&#x438;&#x442;&#x463;, &#x43A;&#x430;&#x43A; &#x441;&#x467; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430; &#x43D;&#x463;&#x43A;&#x43E;&#x439; &#x437;&#x43D;&#x430;&#x43A;, &#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x47F;&#x432;&#x43E;&#x440;&#x435;&#x442;&#x463; <i>.XCompose</i> &#x432; &#x441;&#x46B;&#x449;&#x430;&#x442;&#x430; &#x43F;&#x430;&#x43F;&#x43A;&#x430;, &#x43A;&#x46B;&#x434;&#x463;&#x442;&#x43E; &#x435; &#x438; &#x442;&#x43E;&#x437;&#x438; &#x444;&#x430;&#x439;&#x43B;, &#x438; &#x43F;&#x47F;&#x44A;&#x440;&#x441;&#x435;&#x442;&#x435; &#x432; &#x43D;&#x463;&#x433;&#x43E;.</p>

<p>&#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439; &#x447;&#x435; &#x441;&#x467; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x432;&#x430;&#x442;&#x463; &#x441; &#x442;&#x430;&#x43A;&#x438;&#x432;&#x430; &#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#xA657; &#x43A;&#x430;&#x442;&#x43E; &#x437;&#x430;&#x43D;&#x430;&#xA657;&#x442;&#x447;&#xA657; &#x438;&#x43B;&#x438; &#x43F;&#x43E; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x430;&#x43D;&#x465;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x438; &#x435; &#x43F;&#x43E;-&#x434;&#x43E;&#x431;&#x440;&#x435; &#x434;&#x430; &#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x442;&#x463; &#x43A;&#x43B;&#x430;&#x432;&#xA657;&#x442;&#x443;&#x440;&#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x463;&#x434;&#x431;&#x430; &ndash; &#x437;&#x432;&#xA64B;&#x43A;&#x43E;&#x432;&#x430; &#x438;&#x43B;&#x438; &#x43F;&#x43E; &#x411;&#x414;&#x421;.(&#x412;&#x441;&#x435; &#x43E;&#x449;&#x435; &#x43D;&#x463;&#x43C;&#x430; &#x442;&#x430;&#x43A;&#x430;&#x432;&#x430; &#x441;&#x44A;&#x437;&#x434;&#x430;&#x434;&#x435;&#x43D;&#x430;.)</p>

<h1 id="3">&#x412;&#x41D;&#x462;&#x414;&#x420;&#x462;&#x412;&#x410;&#x41D;&#x415;</h1>

<p>&#xA640;&#x430;&#x441;&#x463;&#x433;&#x430; &#x432;&#x43D;&#x463;&#x434;&#x440;&#x463;&#x432;&#x430;&#x43D;&#x435;&#x442;&#x43E; &#x435; &#x440;&#x46B;&#x447;&#x43D;&#x43E;. &#x422;&#x440;&#x435;&#x431;&#x432;&#x430; &#x434;&#x430; &#x43F;&#x440;&#x43E;&#x447;&#x435;&#x442;&#x435;&#x442;&#x463; &#xA64B;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F;&#x442;&#x430; &#x43F;&#x43E;-&#x434;&#x43E;&#x43B;&#x443;. &#x41F;&#x440;&#x438; &#x43D;&#x463;&#x43A;&#x43E;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x432;&#x430;&#x449;&#x43E; &#x438;&#x437;&#x434;&#x430;&#x43D;&#x465;, &#x449;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43C; &#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;, &#x43A;&#x43E;&#x44F;&#x442;&#x43E; &#x434;&#x430; &#x433;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438; &#x432;&#x43C;&#x463;&#x441;&#x442;&#x43E; &#x432;&#x430;&#x441;. &#x412;&#x441;&#x463; &#x43F;&#x430;&#x43A; &#x435; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x434;&#x430; &#x437;&#x43D;&#x430;&#x435;&#x442;&#x435; &#x43A;&#x430;&#x43A; &#x440;&#x430;&#x431;&#x47F;&#x438;.</p>

<h1 id="4">&#xA64A;&#x41A;&#x410;&#x417;&#x410;&#x41D;&#xA656;</h1>

<h2 id="XCompose">&#x41A;&#x430;&#x43A;&#x44A; &#x440;&#x430;&#x431;&#x47F;&#x438; <code>.XCompose</code>?</h2>

<p>&#x412; &#x42E;&#x43D;&#x438;&#x46F;-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x438;&#x442;&#x463; &#x443;&#x440;&#x463;&#x434;&#x431;&#x438; &#x441;&#x467; &#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x442; &#x43D;&#x430;&#x439;-&#x447;&#x467;&#x441;&#x442;&#x43E; &#x434;&#x432;&#x463; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x463;&#x432;&#x430;&#x449;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x43D;&#x438; &#x441;&#x440;&#x463;&#x434;&#x438; &ndash; KDE &#x438;&#x43B;&#x438; GNOME. &#x422;&#x435;&#x437;&#x438; &#x441;&#x440;&#x463;&#x434;&#x438; &#x438;&#x437;&#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x442; &#x441;&#x432;&#x43E;&#x438; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x438; &#x43A;&#x43D;&#x438;&#x433;&#x43E;&#x432;&#x43D;&#x438; &#x437;&#x430; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x463;&#x432;&#x430;&#x43D;&#x435; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x437;&#x43E;&#x440;&#x446;&#x438;, &#x43A;&#x43E;&#x43F;&#x447;&#x435;&#x442;&#x430; &#x438; &#x434;&#x440;&#x443;&#x433;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x438; &#x43D;&#x430;&#x433;&#x43E;&#x434;&#x463;. &#x41E;&#x431;&#x449;&#x43E; &#x432;&#xA641;&#x463;&#x442;&#x43E; &#x442;&#x435;&#x437;&#x438; &#x434;&#x432;&#x435;&#x442;&#x463; (Qt &#x438; GTK+) &#x43A;&#x43D;&#x438;&#x433;&#x43E;&#x432;&#x43D;&#x438; &#x441;&#x46B; &#x43D;&#x430;&#x439;-&#x438;&#x437;&#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x442;&#x463; &#x438; &#x441;&#x467; &#x438;&#x437;&#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x442;&#x44A; &#x438; &#x47F; &#x434;&#x440;&#x443;&#x433;&#x438; &#x440;&#x430;&#x431;&#x47F;&#x43D;&#x438; &#x441;&#x440;&#x463;&#x434;&#x438; &#x43A;&#x430;&#x442;&#x43E; XFCE, LXQT, LXDE, &#x43A;&#x430;&#x43A;&#x442;&#x43E; &#x438; &#x47F; &#x432;&#x441;&#x463;&#x43A;&#x43E; &#x43F;&#x43E;-&#x432;&#x430;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x465;.</p>

<p>&#x417;&#x430; &#x434;&#x430; &#x438;&#x437;&#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x442; &#x442;&#x43E;&#x437;&#x438; &#x444;&#x430;&#x439;&#x43B; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;&#x442;&#x435;, &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x463;&#x432;&#x430;&#x449;&#x438; &#x442;&#x432;&#x430;&#x440;&#x438;&#x442;&#x463; &#x441;&#x438; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x442;&#x430; &#x43D;&#x430; &#x433;&#x43E;&#x440;&#x435;&#x443;&#x43F;&#x43E;&#x43C;&#x463;&#x43D;&#x430;&#x442;&#x438;&#x442;&#x463; &#x434;&#x432;&#x435; &#x43A;&#x43D;&#x438;&#x433;&#x43E;&#x432;&#x43D;&#x438;, &#x43F;&#x44A;&#x440;&#x432;&#x43E; &#x442;&#x440;&#x463;&#x431;&#x432;&#x430; &#x434;&#x430; &#x441;&#x467; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x438; &#x435;&#x434;&#x43D;&#x430; &#x43E;&#x43F;&#x440;&#x463;&#x434;&#x463;&#x43B;&#x435;&#x43D;&#x430; &#x441;&#x442;&#x43E;&#x439;&#x43D;&#x43E;&#x441;&#x442; &#x43D;&#x430; &#x434;&#x432;&#x435; &#x43F;&#x440;&#x43E;&#x43C;&#x463;&#x43D;&#x43B;&#x438;&#x432;&#x438; &#x43D;&#x430; &#x43E;&#x431;&#x43A;&#x440;&#x46B;&#x436;&#x435;&#x43D;&#x465;&#x442;&#x43E; &#x435;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x430;:</p>

<pre><code>    export GTK_IM_MODULE=&quot;gtk-im-context-simple&quot;
    export QT_IM_MODULE=&quot;gtk-im-context-simple&quot;</code></pre>

<p>&#x41F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x435;&#x442;&#x463; &#x433;&#x43E;&#x440;&#x43D;&#x438;&#x442;&#x463; &#x434;&#x432;&#x463; &#x43E;&#x43F;&#x440;&#x463;&#x434;&#x463;&#x43B;&#x435;&#x43D;&#xA657; &#x432;&#x44A; &#x444;&#x430;&#x439;&#x43B;&#x430; <code>~/.profile</code>. &#x422;&#x430;&#x43A;&#x430; &#x432;&#x438;&#x43D;&#x430;&#x433;&#x438;, &#x43A;&#x43E;&#x433;&#x430;&#x442;&#x43E; &#x432;&#x43B;&#x438;&#x437;&#x430;&#x442;&#x463; &#x432;&#x44A; &#x432;&#x430;&#x448;&#x430;&#x442;&#x430; &#x440;&#x430;&#x431;&#x47F;&#x43D;a &#x441;&#x440;&#x463;&#x434;&#x430;, &#x442;&#x435;&#x437;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x463;&#x43D;&#x43B;&#x438;&#x432;&#x438; &#x449;&#x435; &#xA64B;&#x43A;&#x430;&#x437;&#x432;&#x430;&#x442; &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#xA657;&#x442;&#x430; &#x434;&#x430; &#x437;&#x430;&#x440;&#x463;&#x436;&#x434;&#x430;&#x442; &#x444;&#x430;&#x439;&#x43B;&#x430; <code>~/.XCompose</code> &#x438;&#x43B;&#x438; &#xA64B;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x46D; &#x444;&#x430;&#x439;&#x43B; &#x432;&#x44A; &#x441;&#x442;&#x43E;&#x439;&#x43D;&#x43E;&#x441;&#x442;&#x442;&#x430; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x463;&#x43D;&#x43B;&#x438;&#x432;&#x430;&#x442;&#x430; &#x43D;&#x430; &#x43E;&#x431;&#x43A;&#x440;&#x46B;&#x436;&#x435;&#x43D;&#x465;&#x442;&#x43E; <code>$XCOMPOSEFILE</code>.</p>

<p>&#x421;&#x438;&#x440;&#x435;&#x447;, &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x463; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x463; &#x442;&#x43E;&#x437;&#x438; <code>.XCompose</code> &#x432; &#x434;&#x43E;&#x43C;&#x430;&#x448;&#x43D;&#x430;&#x442;&#x430; &#x441;&#x438; &#x43F;&#x430;&#x43F;&#x43A;&#x430;, &#x438;&#x43B;&#x438; &#x432;&#x44A; <code>~/.profile</code> &#x434;&#x430; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x463; &#x438; &#x441;&#x43B;&#x463;&#x434;&#x43D;&#x46D; &#x440;&#x463;&#x434; (&#x43F;&#x440;&#x438;&#x43C;&#x463;&#x440;):</p>

<pre><code>    export XCOMPOSEFILE=&quot;$HOME/opt/dev/SlovoXCompose/.XCompose&quot;</code></pre>

<p>&#x417;&#x430;&#x43C;&#x463;&#x441;&#x442;&#x435;&#x442;&#x463; &#x43F;&#x46B;&#x442;&#x46D; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x46B; &#x441;&#x43F;&#x43E;&#x440;&#x435;&#x434; &#x442;&#x43E;&#x432;&#x430; &#x43A;&#x46B;&#x434;&#x463; &#x441;&#x435; &#x43D;&#x430;&#x43C;&#x438;&#x440;&#x430; &#x43D;&#x430; &#x432;&#x430;&#x448;&#x430;&#x442;&#x430; &#x43C;&#x430;&#x448;&#x438;&#x43D;&#x430;. &#x422;&#x43E;&#x432;&#x430; &#x435;. &#x418;&#x437;&#x43B;&#x463;&#x437;&#x442;&#x463; &#x438; &#x432;&#x43B;&#x463;&#x437;&#x442;&#x463; &#x47F;&#x43D;&#x43E;&#x432;&#x43E; &#x432; &#x440;&#x430;&#x431;&#x47F;&#x43D;&#x430;&#x442;&#x430; &#x441;&#x438; &#x441;&#x440;&#x463;&#x434;&#x430;, &#x437;&#x430; &#x434;&#x430; &#x441;&#x467; &#x437;&#x430;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x430;&#x442; &#x43F;&#x440;&#x43E;&#x43C;&#x463;&#x43D;&#x438;&#x442;&#x463;.</p>

<h2 id="pod">&#x41A;&#x430;&#x43A; &#x434;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x46B; &#x441;&#x442;&#x430;&#x440;&#x438;&#x442;&#x463; &#x431;&#xA64B;&#x43A;&#x432;&#x438;?</h2>

<p>&#x41F;&#x440;&#x435;&#x434;&#x438; &#x434;&#x430; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x463; &#x434;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x442;&#x463; &#x441;&#x442;&#x430;&#x440;&#x438; &#x431;&#xA64B;&#x43A;&#x432;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x442;&#x430; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x432;&#xA657;&#x442;&#x443;&#x440;&#x430;&#x442;&#x430;, &#x435; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x434;&#x430; &#x437;&#x430;&#x434;&#x430;&#x434;&#x435;&#x442;&#x463;/&#xA64B;&#x43A;&#x430;&#x436;&#x435;&#x442;&#x463;/&#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x463; &#x432;&#x430;&#x448;&#x438;&#x46D; <i>&#x421;&#x44A;&#x441;&#x442;&#x430;&#x432;&#x435;&#x43D; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;</i> (Compose key). &#x41D;&#x430; &#x441;&#x44A;&#x432;&#x440;&#x435;&#x43C;&#x469;&#x43D;&#x438;&#x442;&#x435; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x438; &#x43D;&#x463;&#x43C;&#x430; &#x442;&#x430;&#x43A;&#x44A;&#x432; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;, &#x442;&#x430;&#x43A;&#x430; &#x447;&#x435; &#x442;&#x440;&#x463;&#x431;&#x432;&#x430; &#x434;&#x430; &#x441;&#x438; &#x438;&#x437;&#x431;&#x435;&#x440;&#x435;&#x442;&#x463; &#x43D;&#x463;&#x43A;&#x43E;&#x439; &#x440;&#x463;&#x434;&#x43A;&#x43E; &#x438;&#x437;&#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430;&#x43D; &#x437;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438; &#x446;&#x435;&#x43B;&#x438; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448; &#x438; &#x434;&#x430; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x463; &#x43D;&#x435;&#x433;&#x43E;. &#x412;&#x44A; &#x444;&#x430;&#x439;&#x43B;&#x46B; <code>/usr/share/X11/xkb/rules/xorg.lst</code> &#x438;&#x43C;&#x430; &#x43F;&#x44A;&#x43B;&#x435;&#x43D; &#x441;&#x43F;&#x438;&#x441;&#x44A;&#x43A; &#x441; &#x432;&#x44A;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x438;&#x442;&#x463; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;&#x438;. &#x415;&#x442;&#x43E; &#x433;&#x43E;.</p>

<pre><code>  Compose key          Position of Compose key
  (&#x421;&#x44A;&#x441;&#x442;&#x430;&#x432;&#x435;&#x43D;)           (&#x41C;&#x463;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x465; &#x43D;&#x430; &#x441;&#x44A;&#x441;&#x442;&#x430;&#x432;&#x43D;&#x46D; &#x43A;&#x43B;&#x44E;&#x447;)
  compose:ralt         Right Alt
  compose:lwin         Left Win
  compose:lwin-altgr   3rd level of Left Win
  compose:rwin         Right Win
  compose:rwin-altgr   3rd level of Right Win
  compose:menu         Menu
  compose:menu-altgr   3rd level of Menu
  compose:lctrl        Left Ctrl
  compose:lctrl-altgr  3rd level of Left Ctrl
  compose:rctrl        Right Ctrl
  compose:rctrl-altgr  3rd level of Right Ctrl
  compose:caps         Caps Lock
  compose:caps-altgr   3rd level of Caps Lock
  compose:102          &amp;lt;Less/Greater&amp;gt;
  compose:102-altgr    3rd level of &amp;lt;Less/Greater&amp;gt;
  compose:paus         Pause
  compose:prsc         PrtSc
  compose:sclk         Scroll Lock</code></pre>

<p>&#x422;&#x43E;&#x437;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x44A;&#x43A; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430; &#x441;&#x467; &#x432;&#x438;&#x434;&#x438; &#x432; &#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x43D;&#x438;&#x442;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438; &#x437;&#x430; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x430;&#x442;&#x430; &#x432; KDE, GNOME, XFCE&hellip;</p>

<img src="img/kompose_key_2019-05-05_20-56-42.png" width="800">

<p>&#x414;&#x43E;&#x43F;&#x44A;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x43D;&#x43E; (&#x432; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438;&#x442;&#x463; &#x437;&#x430; &#x442;&#x440;&#x435;&#x442;&#x43E; &#x43D;&#x438;&#x432;&#x43E;) &#x449;&#x435; &#x432;&#x438;&#x434;&#x438;&#x442;&#x463;:</p>

<pre><code>  lv3:ralt_switch_multikey Right Alt; Shift+Right Alt as Compose</code></pre>

<p>&#x410;&#x437; &#x43F;&#x440;&#x463;&#x434;&#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x43C; &#x43D;&#x463;&#x433;&#x43E;.</p>

<p>XFCE &#x43D;&#x463;&#x43C;&#x430; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x43D;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438; &#x437;&#x430; &#x442;&#x440;&#x435;&#x442;&#x43E; &#x43D;&#x438;&#x432;&#x43E;, &#x43D;&#x43E; &#x442;&#x430;&#x437;&#x438; &#x441;&#x442;&#x43E;&#x439;&#x43D;&#x43E;&#x441;&#x442; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430; &#x441;&#x435; &#x437;&#x430;&#x434;&#x430;&#x434;&#x435; &#x447;&#x440;&#x463;&#x437; &#x442;.&#x43D;&#x430;&#x440;. &bdquo;&#x420;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440; &#x43D;&#x430; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438;&#x442;&#x463;&ldquo;. &#x415;&#x442;&#x43E; &#x43A;&#x430;&#x43A; &#x438;&#x437;&#x433;&#x43B;&#x435;&#x436;&#x434;&#x430;.</p>

<img src="img/ralt_switch_multikey.png" width="800">

<p>&#x422;&#x430;&#x43A;&#x430; &#x432; XFCE &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x463; &#x445;&#x435;&#x43C; &#x434;&#x430; &#x437;&#x430;&#x434;&#x430;&#x434;&#x435;&#x442;&#x463; <i>&#x421;&#x44A;&#x441;&#x442;&#x430;&#x432;&#x435;&#x43D; &#x43A;&#x43B;&#x44E;&#x447;</i>, &#x445;&#x435;&#x43C; &#x434;&#x430; &#x437;&#x430;&#x434;&#x430;&#x434;&#x435;&#x442;&#x463; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448; (&#x43A;&#x43B;&#x44E;&#x447;) &#x437;&#x430; &#x442;&#x440;&#x435;&#x442;&#x43E; &#x43D;&#x438;&#x432;&#x43E;. &#x41A;&#x43B;&#x44E;&#x447;&#x44A;&#x442; &#x437;&#x430; &#x442;&#x440;&#x435;&#x442;&#x43E; &#x43D;&#x438;&#x432;&#x43E; &#x441;&#x435; &#x438;&#x437;&#x43F;&#x43E;&#x43B;&#x437;&#x443;&#x432;&#x430; &#x432; &#x434;&#x440;&#x443;&#x433;&#x438; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x438;.</p>

<ul>

<p><b>&#x421;&#x430;&#x43C;&#x43E;&#x442;&#x43E; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x43D;&#x435; &#x441;&#x442;&#x430;&#x432;&#x430; &#x43F;&#x43E; &#x441;&#x43B;&#x463;&#x434;&#x43D;&#x46D; &#x43D;&#x430;&#x447;&#x438;&#x43D;:</b></p>

<p>&#x41D;a&#x442;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x438;&#x437;&#x431;&#x440;&#x430;&#x43D;&#x46D; <i>&#x441;&#x44A;&#x441;&#x442;&#x430;&#x432;&#x435;&#x43D; &#x43A;&#x43B;&#x44E;&#x447;</i> (Compose). &#x41F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x433;&#x43E;. &#x41D;&#x435; &#x433;&#x43E; &#x434;&#x44A;&#x440;&#x436;&#x438;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x43D;&#x43E; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43D;&#x430;&#x442;. &#x421;&#x43B;&#x463;&#x434; &#x442;&#x43E;&#x432;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x442;&#x435; &#x43F;&#x44A;&#x440;&#x432;&#x430;&#x442;&#x430;, &#x430; &#x441;&#x43B;&#x435;&#x434; &#x43D;&#x435;&#xA657; &#x438; &#x432;&#x442;&#x43E;&#x440;&#x430;&#x442;&#x430; &#x431;&#xA64B;&#x43A;&#x432;&#x430; &#x47F; &#x43F;&#x43E;&#x441;&#x43B;&#x463;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x442;&#x430;.</p>

<p>&#x41F;&#x440;&#x438;&#x43C;&#x463;&#x440; (&#x437;&#x430; &#x441;&#x44A;&#x441;&#x442;&#x430;&#x432;&#x435;&#x43D; &#x43A;&#x43B;&#x44E;&#x447; &#x435; &#x438;&#x437;&#x431;&#x440;&#x430;&#x43D; Shift+Right Alt):</p>

<ul>

<p>&#xA640;&#x430; &#x434;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x434;&#x435;&#x442;&#x463; &bdquo;&#x46F;&rdquo; &#x43A;&#x430;&#x442;&#x43E; &#x432; &bdquo;&#x41B;&#x438;&#x43D;&#x443;&#x46F;&rdquo;, &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x435;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; Shift &#x438; &#x434;&#x435;&#x441;&#x435;&#x43D; Alt, &#x430; &#x441;&#x43B;&#x435;&#x434; &#x442;&#x43E;&#x432;&#x430; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x463;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E; &bdquo;&#x43A;&rdquo; &#x438; &bdquo;&#x441;&rdquo;.</p>

<p>&#xA640;&#x430; &#x434;&#x430; &#x43D;&#x430;&#x43F;&#x438;&#x448;&#x435;&#x442;&#x435; &bdquo;&#xA641;&#x435;&#x43C;&#xA657;&rdquo;, &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x435;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; Shift &#x438; &#x434;&#x435;&#x441;&#x435;&#x43D; Alt, &#x430; &#x441;&#x43B;&#x435;&#x434; &#x442;&#x43E;&#x432;&#x430; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x463;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E; &bdquo;&#x437;&rdquo; &#x438; &bdquo;&#x435;&rdquo;. &#x421;&#x43B;&#x463;&#x434; &#x442;&#x43E;&#x432;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x44A;&#x43B;&#x436;&#x430;&#x432;&#x430;&#x442;&#x435; &#x441;&#x44A; &bdquo;&#x435;&#x43C;&rdquo;. &#x421;&#x43B;&#x435;&#x434; &#x43A;&#x43E;&#x435;&#x442;&#x43E;, &#xA641;&#x430; &#x434;&#x430; &#x43D;&#x430;&#x43F;&#x438;&#x448;&#x435;&#x442;&#x435; &#xA657;, &#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x435; &#x43A;&#x430;&#x43A;&#x442;&#x43E; &#x43F;&#x440;&#x438; &#xA641; &ndash; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x435;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; Shift &#x438; &#x434;&#x435;&#x441;&#x435;&#x43D; Alt, &#x430; &#x441;&#x43B;&#x435;&#x434; &#x442;&#x43E;&#x432;&#x430; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x463;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E; &bdquo;&#x438;&rdquo; &#x438; &bdquo;&#x430;&rdquo;.</p>

</ul>

<p>&#x410; &#x435;&#x442;&#x43E; &#x438; &#x432;&#x441;&#x438;&#x447;&#x43A;&#x438; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438; &#x432; &#x442;&#x43E;&#x437;&#x438; .XCompose &#x441;&#x44A;&#x447;&#x435;&#x442;&#x430;&#x43D;&#x438;&#x44F; &#x437;&#x430; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x43D;&#x435;. &bdquo;<code>||</code>&rdquo; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x432;&#x430; &bdquo;<code>&#x438;&#x43B;&#x438;</code>&rdquo;:</p>

</ul>

<pre><code>    Compose,&#x417;,E =&gt; &#xA640;
    Compose,&#x437;,e =&gt; &#xA641;
    Compose,&#x417;,&#x417; =&gt; S
    Compose,&#x437;,&#x437; =&gt; s
    Compose,&#x414;,&#x417; =&gt; &#xA642;
    Compose,&#x434;,&#x437; =&gt; &#xA643;
    Compose,&#x418;,. =&gt; &#x406; || Compose,.,&#x418; =&gt; &#x406;
    Compose,&#x438;,. =&gt; &#x456; || Compose,.,&#x438; =&gt; &#x456;
    Compose,&#x418;,: =&gt; &#x407; || Compose,:,&#x418; =&gt; &#x407;
    Compose,&#x438;,: =&gt; &#x457; || Compose,:,&#x438; =&gt; &#x457;
    Compose,&#x41E;,&#x423; =&gt; &#x478; || Compose,&#x423;,&#x41E; =&gt; &#x478; || Compose,&#x423;,&#x43E; =&gt; &#x478; || Compose,&#x41E;,&#x443; =&gt; &#x478;
    Compose,&#x43E;,&#x443; =&gt; &#x479;
    Compose,&#x423;,&#x41A; =&gt; &#xA64A; || Compose,&#x423;,&#x43A; =&gt; &#xA64A;
    Compose,&#x443;,&#x43A; =&gt; &#xA64B;
    Compose,&#x41E;,&#x41C; =&gt; &#x460; || Compose,&#x41E;,&#x43C; =&gt; &#x460;
    Compose,&#x43E;,&#x43C; =&gt; &#x461;
    Compose,&#x42F;,&#x415; =&gt; &#x462; || Compose,&#x415;,&#x42F; =&gt; &#x462;
    Compose,&#x44F;,&#x435; =&gt; &#x463; || Compose,&#x435;,&#x44F; =&gt; &#x463;
    Compose,&#x418;,&#x410; =&gt; &#xA656; || Compose,&#x418;,&#x430; =&gt; &#xA656;
    Compose,&#x438;,&#x430; =&gt; &#xA657;
    Compose,&#x418;,&#x415; =&gt; &#x464;
    Compose,&#x438;,&#x435; =&gt; &#x465;
    Compose,&#x415;,&#x41D; =&gt; &#x466; || Compose,&#x410;,&#x41D; =&gt; &#x466; || Compose,&#x415;,&#x43D; =&gt; &#x466; || Compose,&#x410;,&#x43D; =&gt; &#x466;
    Compose,&#x435;,&#x43D; =&gt; &#x467; || Compose,a,&#x43D; =&gt; &#x467;
    Compose,&#x418;,&#x41D; =&gt; &#x468; || Compose,&#x42F;,&#x41D; =&gt; &#x468; || Compose,&#x418;,&#x43D; =&gt; &#x468; || Compose,&#x42F;,&#x43D; =&gt; &#x468;
    Compose,&#x438;,&#x43D; =&gt; &#x469; || Compose,&#x44F;,&#x43D; =&gt; &#x469;
    Compose,&#x42A;,&#x41D; =&gt; &#xA658; || Compose,&#x42A;,&#x43D; =&gt; &#xA658;
    Compose,&#x44A;,&#x43D; =&gt; &#xA659;
    Compose,&#x419;,&#x41D; =&gt; &#xA65C; || Compose,&#x419;,&#x43D; =&gt; &#xA65C;
    Compose,&#x439;,&#x43D; =&gt; &#xA65D;
    Compose,&#x415;,&#x41C; =&gt; &#x46A; || Compose,&#x415;,&#x43C; =&gt; &#x46A; || Compose,&#x410;,&#x43C; =&gt; &#x46A; || Compose,&#x410;,&#x41C; =&gt; &#x46A;
    Compose,&#x42A;,&#x410; =&gt; &#x46A; || Compose,&#x410;,&#x42A; =&gt; &#x46A; || Compose,&#x42A;,&#x430; =&gt; &#x46A; || Compose,&#x410;,&#x44A; =&gt; &#x46A;
    Compose,&#x435;,&#x43C; =&gt; &#x46B; || Compose,&#x430;,&#x43C; =&gt; &#x46B;
    Compose,&#x44A;,&#x430; =&gt; &#x46B; || Compose,&#x430;,&#x44A; =&gt; &#x46B;
    Compose,&#x418;,&#x41C; =&gt; &#x46C; || Compose,&#x42F;,&#x41C; =&gt; &#x46C; || Compose,&#x418;,&#x42F; =&gt; &#x46C; || Compose,&#x418;,&#x44F; =&gt; &#x46C;
    Compose,&#x438;,&#x43C; =&gt; &#x46D; || Compose,&#x438;,&#x44F; =&gt; &#x46D;
    Compose,&#x418;,&#x42A; =&gt; &#x46C; || Compose,&#x418;,&#x44A; =&gt; &#x46C;
    Compose,&#x438;,&#x44A; =&gt; &#x46D;
    Compose,&#x41A;,&#x421; =&gt; &#x46E;
    Compose,&#x43A;,&#x441; =&gt; &#x46F;
    Compose,&#x41F;,&#x421; =&gt; &#x470;
    Compose,&#x43F;,&#x441; =&gt; &#x471;
    Compose,&#x422;,&#x425; =&gt; &#x472; || Compose,&#x422;,&#x424; =&gt; &#x472;
    Compose,&#x442;,&#x445; =&gt; &#x473; || Compose,&#x442;,&#x444; =&gt; &#x473;
    Compose,&#x423;,&#x416; =&gt; &#x474; || Compose,&#x418;,&#x416; =&gt; &#x474;
    Compose,&#x443;,&#x436; =&gt; &#x475; || Compose,&#x438;,&#x436; =&gt; &#x475;
    Compose,&#x416;,: =&gt; &#x476;
    Compose,&#x436;,: =&gt; &#x477;
    Compose,&#x41A;,&#x41E; =&gt; &#x480;
    Compose,&#x43A;,&#x43E; =&gt; &#x481;
    Compose,&#x41E;,&#x422; =&gt; &#x47E;
    Compose,&#x43E;,&#x442; =&gt; &#x47F;
    Compose,&#x418;,&#x418; =&gt; &#x42B;
    Compose,&#x438;,&#x438; =&gt; &#x44B;</code></pre>

<h1 id="5">&#x41F;&#x420;&#x418;&#x41D;&#x41E;&#x421;</h1>

<p>&#x41C;&#x43E;&#x436;&#x435;&#x442;&#x463; &#x434;&#x430; &#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43D;&#x435;&#x442;&#x435; &#x43A;&#x430;&#x442;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x463; &#x43D;&#x43E;&#x432;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x47F; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;&#x438; &#x438;&#x43B;&#x438; &#x43A;&#x430;&#x442;&#x43E; &#x43F;&#x43E;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x435; &#x43D;&#x435;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x435;&#x449;&#x438;&#x442;&#x435; &#x432;&#x463;&#x447;&#x463; &#x441;&#x46B;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x432;&#x430;&#x449;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x432;&#x430;. &#x41D;&#x43E;&#x432;&#x430;&#x442;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x463;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x43D;&#x43E;&#x441;&#x442; &#x449;&#x435; &#x437;&#x430;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x438; &#x441;&#x43B;&#x463;&#x434; &#x43A;&#x430;&#x442;&#x43E; &#x441;&#x43F;&#x440;&#x463;&#x442;&#x463; &#x438; &#x43F;&#x443;&#x441;&#x43D;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x465;&#x442;&#x43E; (&#x432; &#x43A;&#x43E;&#x435;&#x442;&#x43E; &#x432;&#x44A;&#x432;&#x463;&#x436;&#x434;&#x430;&#x442;&#x463; &#x431;&#xA64B;&#x43A;&#x432;&#x438;&#x442;&#x463;) &#x47F;&#x43D;&#x43E;&#x432;&#x43E;.</p>

<h1 id="6">&#x421;&#x42A;&#x421;&#x422;&#x410;&#x412;&#x418;&#x41B; &#x422;&#x41E;&#x412;&#x410; &#x420;&#x46A;&#x41A;&#x41E;&#x412;&#x41E;&#x414;&#x421;&#x422;&#x412;&#x41E;</h1>

<p>&#x41A;&#x440;&#x430;&#x441;&#x438;&#x43C;&#x438;&#x440; &#x411;&#x435;&#x440;&#x43E;&#x432; &lt;berov@cpan.org&gt;</p>

<h1 id="XCompose1">&#x421;&#x42A;&#x421;&#x422;&#x410;&#x412;&#x418;&#x41B; .XCompose</h1>

<p>&#x41A;&#x440;&#x430;&#x441;&#x438;&#x43C;&#x438;&#x440; &#x411;&#x435;&#x440;&#x43E;&#x432;</p>


</body>

</html>


